var updateDataFile = [
    {
        id: 15,
        date: '2025. 11. 22',
        title: 'v2.1',
        content: '- 모바일 메인 페이지 구현\n- 업데이트, 시설안내, 매뉴얼, VOC 등 구현 완료',
        author: '관리자'
    },
    {
        id: 14,
        date: '2025. 10. 15',
        title: 'v2.0',
        content: '- 행정 매뉴얼 구현 완료',
        author: '관리자'
    },
    {
        id: 13,
        date: '2025. 10. 14',
        title: 'v1.15',
        content: '- 기술 매뉴얼 구현 완료',
        author: '관리자'
    },
    {
        id: 12,
        date: '2025. 07. 16',
        title: 'v1.14',
        content: '- 체육 매뉴얼 구현 완료',
        author: '관리자'
    },
    {
        id: 11,
        date: '2025. 02. 13',
        title: 'v1.13',
        content: '- VOC 구현 (수영장, 다목적체육관, 프로그램실, 기타)',
        author: '관리자'
    },
    {
        id: 10,
        date: '2025. 02. 12',
        title: 'v1.12',
        content: '- 헬프데스크 구현',
        author: '관리자'
    },
    {
        id: 9,
        date: '2025. 02. 05',
        title: 'v1.11',
        content: '- 팝업 공지 구현',
        author: '관리자'
    },
    {
        id: 8,
        date: '2025. 02. 01',
        title: 'v1.10',
        content: '- 메인 페이지 구조 완성',
        author: '관리자'
    },
    {
        id: 7,
        date: '2025. 01. 27',
        title: 'v1.09',
        content: '- css 관련 github&vercel.com 연동 복잡함\n- gitlab 구현, 서버 이전, 전체 링크 수정',
        author: '관리자'
    },
    {
        id: 6,
        date: '2025. 01. 24',
        title: '1.08',
        content: '- 사이드바 스타일 구현 완료료\n- css 관련 vercel.com 연동',
        author: '관리자'
    },
    {
        id: 5,
        date: '2025. 01. 21',
        title: 'v1.07',
        content: '- 통합 매뉴얼 리뉴얼',
        author: '관리자'
    },
    {
        id: 4,
        date: '2024. 11. 07',
        title: 'v1.06',
        content: '- 승강기, 정수기 내부 표 산입\n- 복대 가경 화장실 변기 갯수 업데이트',
        author: '관리자'
    },
    {
        id: 3,
        date: '2024. 11. 03',
        title: 'v1.04',
        content: '- 업데이트 테이블 td 구간별 실선 추가 적용\n- 업데이트 테이블 펼치기 구현시 업데이트 현황과 표사이 간격 조정\n- 표 테이블 th, td 글씨에 맞도록 표 길이 자동으로 조절되도록 적용\n- 시설별 사진 크기 동일하게 나오도록 적용\n- 통합 매뉴얼 메인 v1.04 종료\n- 추가적인 개선 사항은 검토\n- 매뉴얼 행정, 기술, 체육 매뉴얼 페이지 구현 시작\n- 기술 매뉴얼(가경국민체육센터) 구현 중\n- 매뉴얼\\가경국민체육센터\\skill1.html',
        author: '관리자'
    },
    {
        id: 2,
        date: '2024. 11. 02',
        title: 'v1.03',
        content: '- 샤워기, 락커 등 주차장과 동일하게 구현\n- 가경국민체육센터 서식으로 변경 완료\n- 행정 기술 하위분야 본문 작성',
        author: '관리자'
    },
    {
        id: 1,
        date: '2024. 11. 01',
        title: 'v1.02',
        content: '- 업데이트 현황 추가 및 구현\n- 시설현황 시설 조사 데이터 적용\n- 1.5 가경국민체육센터 시설안내 보기 좋게 구현\n- 샤워기, 락커, 등 주차장과 동일하게 구현 필요\n- 1.5 세부현황 및 이용안내 표 크기에 맞도록 구현 필요 창 크기에 따라 가로 세로 글자 배치 변경됨 고정 필요',
        author: '관리자'
    }
];
